// JavaScript Document
var num1; 
var num2;
var syiji=["农业","林业","畜牧业","渔业","农、林、牧、渔服务业",'采矿业','	制造业','电力、热力、燃气及水生产和供应业','建筑业','批发和零售业','交通运输、仓储和邮政业','住宿和餐饮业','信息传输、软件和信息技术服务业','金融业','房地产业','租赁业','商务服务业'];
var serji=[["谷物种植","豆类、油料和薯类种植","棉、麻、糖、烟草种植","蔬菜、食用菌及园艺作物种植","水果种植",'住宿业']
,["林木育种和育苗",'木材和竹材采运','林产品采集']
,["牲畜饲养",'家禽饲养']
,['水产养殖','水产捕捞']
,['农业服务业','林业服务业','畜牧服务业','渔业服务业']
,['煤炭开采和洗选业','石油和天然气开采业']
,['农副食品加工业','植物油加工','屠宰及肉类加工']
,['电力生产','水的生产和供应业']
,['铁路、道路、隧道和桥梁工程建筑','水利和内河港口工程建筑']
,['农、林、牧产品批发']
,['铁路运输业','铁路运输辅助活动','城市公共交通运输','道路运输辅助活动']
,['住宿业','餐饮业','饮料及冷饮服务','其他餐饮业']
,['电信','广播电视传输服务']
,['货币金融服务','非货币银行服务']
,['房地产业']
,['机械设备租赁']
,['企业管理服务']
];
var ssanji=[[["稻谷种植","小麦种植","玉米种植","其他谷物种植"],["豆类种植","油料种植","薯类种植"],["棉花种植","麻类种植","糖料种植","烟草种植"],["蔬菜种植","食用菌种植","花卉种植","其他园艺作物种植"],['仁果类和核果类水果种植','葡萄种植','柑橘类种植','香蕉等亚热带水果种植','其他水果种植']]
,[["林木育种","林木育苗"],["木材采运","竹材采运"],["木竹材林产品采集","非木竹材林产品采集"]]
,[['牛的饲养','马的饲养','猪的饲养','羊的饲养','骆驼饲养','其他牲畜饲养'],['鸡的饲养','鸭的饲养','鹅的饲养','其他家禽饲养']]
,[['海水养殖','内陆养殖'],['海水捕捞','内陆捕捞']]
,[['农业机械服务','灌溉服务','农产品初加工服务','其他农业服务'],['林业有害生物防治服务','森林防火服务','林产品初级加工服务','其他林业服务']]
,[['烟煤和无烟煤开采洗选','褐煤开采洗选','其他煤炭采选'],['石油开采','天然气开采']]
,[['谷物磨制','饲料加工'],['食用植物油加工','非食用植物油加工'],['牲畜屠宰','禽类屠宰','肉制品及副产品加工']]
,[['火力发电','水力发电','核力发电','风力发电','太阳能发电','其他电力生产'],['自来水生产和供应','污水处理及其再生利用','其他水的处理、利用与分配']]
,[['铁路工程建筑','公路工程建筑','市政道路工程建筑','其他道路、隧道和桥梁工程建筑'],['水源及供水设施工程建筑','河湖治理及防洪设施工程建筑','港口及航运设施工程建筑']]
,[['谷物、豆及薯类批发','种子批发','饲料批发','棉、麻批发','林业产品批发','牲畜批发','其他农牧产品批发']]
,[['铁路旅客运输','铁路货物运输','铁路货物运输'],['客运火车站','货运火车站','其他铁路运输辅助活动'],['公共电汽车客运','城市轨道交通','出租车客运','其他城市公共交通运输'],['客运汽车站','公路管理与养护','其他道路运输辅助活动']]
,[['旅游饭店','一般旅馆','其他住宿业'],['正餐服务','快餐服务'],['茶馆服务','咖啡馆服务','酒吧服务','其他饮料及冷饮服务'],['小吃服务','餐饮配送服务','其他未列明餐饮业']]
,[['固定电信服务','移动电信服务','其他电信服务'],['有线广播电视传输服务','无线广播电视传输服务','卫星传输服务']]
,[['中央银行服务','货币银行服务'],['金融租赁服务','财务公司','典当','其他非货币银行服务']]
,[['房地产开发经营','物业管理','房地产中介服务','自有房地产经营活动','其他房地产业']]
,[['农业机械租赁','汽车租赁','建筑工程机械与设备租赁','计算机及通讯设备租赁','其他机械与设备租赁']]
,[['企业总部管理','投资与资产管理	','单位后勤管理服务','其他企业管理服务']]
];
$(function(){
    for(var i=0;i<yiji.length;i++){
    $("#syiji").append("<option>"+syiji[i]+"</option>");
    }
    $("#syiji").change(function(){
        $("#serji").children().not(":eq(0)").remove();
        num1=$(this).children("option:selected").index();
        var aerji1=serji[num1-1];
        for(var j=0;j<aerji1.length;j++){
        $("#serji").append("<option>"+aerji1[j]+"</option>");
        }
    $("#serji").change(function(){
        $("#ssanji").children().not(":eq(0)").remove();
        num2=$(this).children("option:selected").index();
        var ssanji1=ssanji[num1-1][num2-1];
        for( var z=0;z<ssanji1.length;z++){
        $("#ssanji").append("<option>"+ssanji1[z]+"</option>");
        }
        });
        });
    });