// JavaScript Document
var num1; 
var num2;
var yiji=["数学史","数论","代数学","代数几何学","拓扑学","数学分析","非标准分析","常微分方程","偏微分方程","动力系统","积分方程","计算数学","概率论","数理统计学","应用统计数学","运筹学","宁夏省","新疆省","河北省","山西省","内蒙古省","江苏省","浙江省","安徽省","福建省","江西省","山东省","辽宁省","吉林省","黑龙江省","海南省","台湾省","香港省","澳门省"];
var erji=[["数理逻辑与数学基础"]
,["数论"]
,["代数学"]
,['几何学']
,['拓扑学']
,['数学分析']
,['函数论']
,['常微分方程']
,["偏微分方程"]
,['动力系统']
,['泛函分析']
,['计算数学']
,['概率论']
,['数理统计学']
,['应用统计数学']
,['运筹学']
,['银川市','石嘴山市','吴忠市','固原市','中卫市']
,['乌鲁木齐市','克拉玛依市','吐鲁番地区','哈密地区','昌吉回族自治州','博尔塔拉蒙古自治州','巴音郭楞蒙古自治州','阿克苏地区','克孜勒苏柯尔克孜自治州','喀什地区','和田地区','伊犁哈萨克自治州','塔城地区','阿勒泰地区','省直辖行政单位']
,['石家庄市','唐山市','秦皇岛市','邯郸市','邢台市','保定市','张家口市','承德市','沧州市','廊坊市','衡水市']
,["太原市","大同市","阳泉市",'长治市','晋城市','朔州市','晋中市','运城市','忻州市','临汾市','吕梁市']
,['呼和浩特市','包头市','乌海市','赤峰市','通辽市','鄂尔多斯市','呼伦贝尔市','巴彦淖尔市','乌兰察布市','兴安盟','锡林郭勒盟','阿拉善盟']
,['南京市','无锡市','徐州市','常州市','苏州市','南通市','连云港市','淮安市','盐城市','扬州市','镇江市','泰州市','宿迁市']
,['杭州市','宁波市','温州市','嘉兴市','湖州市','绍兴市','金华市','衢州市','舟山市','台州市','丽水市']
,['合肥市','芜湖市','蚌埠市','淮南市','马鞍山市','淮北市','铜陵市','安庆市','黄山市','滁州市','阜阳市','宿州市','巢湖市','六安市','亳州市','池州市','宣城市']
,['福州市','厦门市','莆田市','三明市','泉州市','漳州市','南平市','龙岩市','宁德市']
,['南昌市','景德镇市','萍乡市','九江市','新余市','鹰潭市','赣州市','吉安市','宜春市','抚州市','上饶市']
,['济南市',"青岛市",'淄博市','枣庄市','东营市','烟台市','潍坊市','济宁市','泰安市','威海市','日照市','莱芜市','临沂市','德州市','聊城市','滨州市','荷泽市']
,['沈阳市','大连市','鞍山市','抚顺市','本溪市','丹东市','锦州市','营口市','阜新市','辽阳市','盘锦市','铁岭市','朝阳市','葫芦岛市']
,['长春市','吉林市','四平市','辽源市','通化市','白山市','松原市','白城市','延边朝鲜族自治州']
,['哈尔滨市','齐齐哈尔市','鸡西市','鹤岗市','双鸭山市','大庆市','伊春市','佳木斯市','七台河市','牡丹江市','黑河市','绥化市','大兴安岭地区']
,['海口市','三亚市','省直辖县级行政单位']
,['台湾市']
,['香港市']
,['澳门市']];
var sanji=[[["演绎逻辑学(亦称符号逻辑学)","证明论(亦称元数学)","递归论","模型论","公理集合论","数学基础","数理逻辑与数学基础其他学科"]]
,[["初等数论","解析数论","代数数论","超越数论","丢番图逼近","数的几何","概率数论","计算数论","数论其他学科"]]
,[['线性代数','群论','域论','李群','李代数','Kac-Moody代数','环论','模论','格论','泛代数理论','范畴论','同调代数','代数K理论','微分代数','代数编码理论','代数学其他学科']]
,[['几何学基础','欧氏几何学','非欧几何学(包括黎曼几何学等)','球面几何学','向量和张量分析','仿射几何学','射影几何学','微分几何学','分数维几何','计算几何学','几何学其他学科']]
,[['点集拓扑学','代数拓扑学','同伦论','低维拓扑学','同调论','维数论','格上拓扑学','纤维丛论','几何拓扑学','奇点理论','微分拓扑学','拓扑学其他学科']]
,[['微分学','积分学','级数论','数学分析其他学科']]
,[['实变函数论','单复变函数论','多复变函数论','函数逼近论','调和分析','复流形','特殊函数论','函数论其他学科']]
,[['定性理论','稳定性理论','解析理论','常微分方程其他学科']]
,[['椭圆型偏微分方程','双曲型偏微分方程','抛物型偏微分方程','非线性偏微分方程','偏微分方程其他学科']]
,[['微分动力系统','拓扑动力系统','复动力系统','动力系统其他学科']]
,[['线性算子理论','变分法','拓扑线性空间','希尔伯特空间','函数空间','巴拿赫空间','算子代数','测度与积分','广义函数论','非线性泛函分析','泛函分析其他学科']]
,[['插值法与逼近论','常微分方程数值解','偏微分方程数值解','积分方程数值解','数值代数','连续问题离散化方法','随机数值实验','误差分析','计算数学其他学科']]
,[['几何概率','概率分布','极限理论','随机过程','马尔可夫过程','随机分析','鞅论','应用概率论','概率论其他学科']]
,[['抽样理论','假设检验','非参数统计','方差分析','相关回归分析','统计推断','贝叶斯统计','试验设计','多元分析','统计判决理论','时间序列分析','数理统计学其他学科']]
,[['统计质量控制','可靠性数学','保险数学','统计模拟','应用统计数学其他学科']]
,[['线性规划','非线性规划','动态规划','组合最优化','参数规划','整数规划','随机规划','排队论','对策论(亦称博奕论)','库存论','决策论','搜索论','图论','统筹论','最优化','运筹学其他学科']]];
$(function(){
    for(var i=0;i<yiji.length;i++){
    $("#yiji").append("<option>"+yiji[i]+"</option>");
    }
    $("#yiji").change(function(){
        $("#erji").children().not(":eq(0)").remove();
        num1=$(this).children("option:selected").index();
        var aerji=erji[num1-1];
        for(var j=0;j<aerji.length;j++){
        $("#erji").append("<option>"+aerji[j]+"</option>");
        }
    $("#erji").change(function(){
        $("#sanji").children().not(":eq(0)").remove();
        num2=$(this).children("option:selected").index();
        var sanji1=sanji[num1-1][num2-1];
        for( var z=0;z<sanji1.length;z++){
        $("#sanji").append("<option>"+sanji1[z]+"</option>");
        }
        });
        });
    });